{
  "conversationId": "elena_scribe_1",
  "npcId": "elena_scribe",
  "initialNode": "greeting",
  "nodes": {
    "greeting": {
      "text": "Oh! I didn't expect... I mean, hello. I'm Elena. I used to work as a scribe before... before the fire. Are you perhaps in need of writing services? I still have my skills, even if I've lost my shop.",
      "choices": [
        {
          "id": "ask_about_fire",
          "text": "I'm sorry to hear about the fire. What happened?",
          "nextNode": "fire_story",
          "focusCost": 0
        },
        {
          "id": "need_letter_written",
          "text": "I might need a letter written. What are your rates?",
          "nextNode": "discuss_rates",
          "focusCost": 0
        },
        {
          "id": "offer_help",
          "text": "Is there anything I can do to help?",
          "nextNode": "grateful_for_offer",
          "focusCost": 0
        }
      ]
    },
    "fire_story": {
      "text": "Three months ago, Master Aldric's shop burned down. They say it was an accident, but... I lost everything. My position, my lodgings, even most of my belongings. Now I write letters here in the square for whatever people can pay.",
      "choices": [
        {
          "id": "sympathize",
          "text": "That must have been devastating. I'm truly sorry.",
          "nextNode": "appreciate_sympathy",
          "focusCost": 0
        },
        {
          "id": "suspicious",
          "text": "You don't think it was an accident?",
          "nextNode": "hint_at_mystery",
          "focusCost": 1
        }
      ]
    },
    "discuss_rates": {
      "text": "I charge 2 coins for a simple letter, 5 for anything requiring official formatting. I know it's not the cheapest, but I guarantee perfect penmanship and proper form. Your words will be given the respect they deserve.",
      "choices": [
        {
          "id": "commission_letter",
          "text": "I'd like you to write a letter for me.",
          "nextNode": "write_letter",
          "focusCost": 0
        },
        {
          "id": "maybe_later",
          "text": "I'll keep that in mind for later.",
          "nextNode": "always_here",
          "focusCost": 0
        }
      ]
    },
    "grateful_for_offer": {
      "text": "You're very kind to ask. Actually... if you hear of anyone needing a skilled scribe, permanent position or temporary work, I'd be grateful if you'd mention my name. I'm trying to save enough to start again.",
      "choices": [
        {
          "id": "promise_to_help",
          "text": "I'll keep an ear out for opportunities.",
          "nextNode": "thankful",
          "focusCost": 0
        }
      ]
    },
    "appreciate_sympathy": {
      "text": "Thank you. It's been hard, but I'm managing. Every letter I write is a step toward rebuilding. Your kindness means more than you know.",
      "isEnd": true,
      "effects": {
        "addToken": {
          "npcId": "elena_scribe",
          "tokenType": "Trust",
          "amount": 1
        }
      }
    },
    "hint_at_mystery": {
      "text": "I... I shouldn't say. But Master Aldric had been writing letters for some very important people. The night before the fire, he seemed worried. He told me to go home early. I never saw him again.",
      "choices": [
        {
          "id": "dont_pursue",
          "text": "Perhaps it's better not to dwell on it.",
          "nextNode": "agree_drop_it",
          "focusCost": 0
        },
        {
          "id": "offer_investigate",
          "text": "If you ever want someone to look into it...",
          "nextNode": "careful_consideration",
          "focusCost": 1
        }
      ]
    },
    "write_letter": {
      "text": "Excellent! Who shall I address it to, and what would you like to say? I'll make sure every word is perfect.",
      "isEnd": true,
      "effects": {
        "addToken": {
          "npcId": "elena_scribe",
          "tokenType": "Trust",
          "amount": 1
        }
      }
    },
    "always_here": {
      "text": "Of course. I'm here most days, rain or shine. A scribe must be reliable, after all.",
      "isEnd": true
    },
    "thankful": {
      "text": "Oh, thank you! That would be wonderful. I promise, anyone who hires me won't regret it. I may have lost my shop, but not my skills or my dedication.",
      "isEnd": true,
      "effects": {
        "addToken": {
          "npcId": "elena_scribe",
          "tokenType": "Trust",
          "amount": 2
        }
      }
    },
    "agree_drop_it": {
      "text": "You're probably right. The past is past. I need to focus on the future.",
      "isEnd": true
    },
    "careful_consideration": {
      "text": "I... I'll think about it. It's dangerous to dig into such matters. But if I ever need someone trustworthy, I'll remember your offer. Thank you.",
      "isEnd": true,
      "effects": {
        "addToken": {
          "npcId": "elena_scribe",
          "tokenType": "Trust",
          "amount": 1
        },
        "addToken": {
          "npcId": "elena_scribe",
          "tokenType": "Shadow",
          "amount": 1
        }
      }
    }
  }
}