{
  "conversationId": "elena_desperate",
  "npcId": "elena",
  "initialNode": "urgent_plea",
  "nodes": {
    "urgent_plea": {
      "text": "Elena's hands tremble as she clutches a sealed letter. 'Please, I need this delivered to Lord Aldwin in Riverside before tomorrow evening. It's... it's my refusal of his marriage proposal. If he doesn't receive it in time, his men will come for me. I've already seen them watching my door.'",
      "choices": [
        {
          "id": "exit",
          "text": "\"I should go. Time is pressing.\"",
          "nextNode": "hasty_exit",
          "attentionCost": 0
        },
        {
          "id": "acknowledge",
          "text": "\"I understand. Your letter is second in my queue.\"",
          "nextNode": "relieved_acknowledgment",
          "attentionCost": 0
        },
        {
          "id": "prioritize",
          "text": "\"I'll prioritize your letter. Let me rearrange my deliveries...\"",
          "nextNode": "grateful_for_priority",
          "attentionCost": 1
        },
        {
          "id": "investigate_aldwin",
          "text": "\"Lord Aldwin from Riverside? Tell me about the situation...\"",
          "nextNode": "explain_aldwin",
          "attentionCost": 1
        },
        {
          "id": "binding_promise",
          "text": "\"I swear I'll deliver your letter before any others today. You have my word.\"",
          "nextNode": "tearful_gratitude",
          "attentionCost": 2
        }
      ]
    },
    "hasty_exit": {
      "text": "Elena nods quickly, trying to hide her disappointment. 'Of course. We all have our duties. Just... please don't forget about me.'",
      "isEnd": true,
      "effects": {
        "endConversation": true
      }
    },
    "relieved_acknowledgment": {
      "text": "Elena exhales shakily. 'Second in queue... that should be soon enough. Thank you for understanding the urgency. Every hour matters.'",
      "isEnd": true,
      "effects": {
        "maintainState": true
      }
    },
    "grateful_for_priority": {
      "text": "Elena's eyes widen with hope. 'You would do that? Oh, thank you! I know Lord Aldwin has influence - this won't be forgotten. Please, be careful on the road to Riverside.'",
      "isEnd": true,
      "effects": {
        "reorderLetter": {
          "targetPosition": 1,
          "tokenCost": {
            "type": "Status",
            "amount": 1,
            "target": "lord_aldwin"
          }
        }
      }
    },
    "explain_aldwin": {
      "text": "Elena glances around nervously before leaning closer. 'Lord Aldwin is wealthy, powerful, and doesn't accept rejection well. He's twice my age and has already buried two wives. The noble carriages leave for Riverside at dawn - if you miss them, the journey takes much longer on foot. Please, use this information wisely.'",
      "isEnd": true,
      "effects": {
        "addInformation": {
          "id": "noble_carriage_schedule",
          "text": "Noble carriages leave at dawn for Riverside, cutting travel time in half"
        },
        "addTime": 20
      }
    },
    "tearful_gratitude": {
      "text": "Tears stream down Elena's face as she grasps your hands. 'You're saving my life. I mean that literally. I'll never forget this kindness. When you return, I'll help you however I can. You've earned more than just my trust - you've earned my loyalty.'",
      "isEnd": true,
      "effects": {
        "addToken": {
          "npcId": "elena",
          "tokenType": "Trust",
          "amount": 2
        },
        "createObligation": {
          "id": "elena_binding_oath",
          "description": "Sworn to deliver Elena's letter before all others",
          "priority": 5,
          "duration": 1
        }
      }
    }
  }
}