[
  {
    "id": "elena_route_discovery",
    "npcId": "elena_millbrook",
    "name": "Secret Forest Path",
    "description": "Elena knows a hidden path through the woods that avoids the main roads.",
    "favorType": "RouteDiscovery",
    "requiredTokenType": "Trust",
    "tokenCost": 2,
    "minimumRelationshipLevel": 5,
    "grantsId": "millbrook_forest_shortcut",
    "offerText": "You know, I've lived here all my life. There's a path through the woods that most folks don't know about...",
    "purchaseText": "Since I trust you, I'll share this secret. Follow the old oak with the broken branch, then look for the moss-covered stones...",
    "refusalText": "Maybe another time then. Some secrets are worth keeping."
  },
  {
    "id": "marcus_noble_introduction",
    "npcId": "marcus_thornwood",
    "name": "Noble Contact Introduction",
    "description": "Marcus can introduce you to a noble contact in the capital.",
    "favorType": "NPCIntroduction",
    "requiredTokenType": "Trade",
    "tokenCost": 3,
    "minimumRelationshipLevel": 7,
    "grantsId": "lord_ashford",
    "offerText": "I've been doing business with Lord Ashford for years. Perhaps it's time I introduced you two...",
    "purchaseText": "I'll write you a letter of introduction. Lord Ashford values my judgment - treat him well.",
    "refusalText": "Very well. Such introductions must be handled delicately anyway."
  },
  {
    "id": "river_worker_shadow_access",
    "npcId": "river_worker",
    "name": "Shadow Market Access",
    "description": "The river worker can get you into the underground market.",
    "favorType": "LocationAccess",
    "requiredTokenType": "Shadow",
    "tokenCost": 2,
    "minimumRelationshipLevel": 4,
    "grantsId": "shadow_market",
    "offerText": "You seem like someone who appreciates... alternative commerce. There's a place I could show you.",
    "purchaseText": "Tonight, after the moon sets. Look for the red lantern by the old pier. Knock three times, then twice.",
    "refusalText": "Smart choice. Not everyone's cut out for that kind of business."
  },
  {
    "id": "workshop_master_equipment",
    "npcId": "workshop_master",
    "name": "Custom Climbing Gear",
    "description": "The workshop master will craft specialized climbing equipment.",
    "favorType": "ItemPurchase",
    "requiredTokenType": "Trade",
    "tokenCost": 4,
    "minimumRelationshipLevel": 6,
    "grantsId": "master_climbing_gear",
    "additionalData": {
      "quantity": "1"
    },
    "offerText": "I've been working on something special. Light, strong, and it'll get you up cliffs others can't climb.",
    "purchaseText": "Here you go - my finest work. The rope is woven with silk for strength and lightness. Use it well.",
    "refusalText": "No worries. Quality gear like this needs the right buyer."
  },
  {
    "id": "elena_letter_opportunity",
    "npcId": "elena_millbrook",
    "name": "Urgent Noble Letter",
    "description": "Elena has a special high-paying letter that needs discrete delivery.",
    "favorType": "LetterOpportunity",
    "requiredTokenType": "Trust",
    "tokenCost": 1,
    "minimumRelationshipLevel": 8,
    "grantsId": "special_noble_letter",
    "offerText": "A noble lady came by yesterday, very secretive. She needs a letter delivered urgently and... quietly.",
    "purchaseText": "I told her about you - said you were trustworthy. The letter will be ready tomorrow morning. The pay is exceptional.",
    "refusalText": "I understand. This kind of work isn't for everyone."
  },
  {
    "id": "dock_master_trade_info",
    "npcId": "dock_master",
    "name": "Shipping Manifest Information",
    "description": "The dock master shares valuable trade route information.",
    "favorType": "InformationPurchase",
    "requiredTokenType": "Trade",
    "tokenCost": 2,
    "minimumRelationshipLevel": 5,
    "additionalData": {
      "information": "The next shipment from the eastern provinces includes rare spices. Buy them here and sell in the capital for triple the price."
    },
    "offerText": "I see all the manifests that come through here. Some of that information could be... profitable for the right person.",
    "purchaseText": "Next week, eastern spice shipment. Buy all you can carry. Trust me on this one.",
    "refusalText": "Your loss. Information is the most valuable cargo of all."
  },
  {
    "id": "camp_boss_equipment_rental",
    "npcId": "camp_boss",
    "name": "Heavy Equipment Rental Service",
    "description": "The camp boss offers access to specialized heavy equipment rentals.",
    "favorType": "ServiceAccess",
    "requiredTokenType": "Common",
    "tokenCost": 3,
    "minimumRelationshipLevel": 5,
    "grantsId": "heavy_equipment_rental",
    "offerText": "We've got equipment here that most folks can't afford to buy. But for the right person, I might consider rentals.",
    "purchaseText": "Alright, you've proven yourself reliable. Come by when you need heavy gear - we'll work out a fair rental price.",
    "refusalText": "Fair enough. This equipment is too valuable to trust to just anyone."
  }
]